Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.ToolOptionNames.ReferenceModels Field
 The reference models.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string ReferenceModels = "sel_reference_models"
Public Const ReferenceModels As String = "sel_reference_models"
Field Value
Type: String
See Also
Reference
TeklaStructuresSettings.ToolOptionNames Class
Tekla.Structures Namespace